Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A05B.tmx
Source language: en_us
Languages: zh_cn

source: The Real Challenge From China: Its People, Not Its Currency
zh_cn: 来自中国的真正挑战是它的人民，不是人民币

source: I love the idea of bipartisanship.
zh_cn: 我喜欢两党合作的想法。

source: Just the image of Democrats and Republicans coming together makes me smile.
zh_cn: 只要想到民主党和共和党走到一起就能令我发笑。

source: "Finally " I say to myself "American government is working."
zh_cn: “终于，”我对自己说：“美国政府可以运作了”。

source: But then I look at what they actually agree on and I begin to pine for paralysis.
zh_cn: 不过随后我看了看他们实际上达成的协议，我开始怀念起（政府）瘫痪的日子。

source: On Sept. 29 the House of Representatives passed a bill with overwhelming support from both Democrats and Republicans.
zh_cn: 今年的9月29日，众议院取得民主、共和两党压倒性的支持通过了一项条例草案。

source: It would punish China for keeping its currency undervalued by slapping tariffs on Chinese goods.
zh_cn: 该法案将会由于中国坚持低估其货币而对中国商品处以惩罚性关税。

source: Everyone seems to agree that it's about time.
zh_cn: 大家似乎都同意是时候了。

source: But it isn't.
zh_cn: 但并非如此。

source: The bill is at best pointless posturing and at worst dangerous demagoguery.
zh_cn: 这一法案往好处说顶多是毫无意义的装腔作势，往最坏处看是危险的蛊惑人心。

source: It won't solve the problem it seeks to fix.
zh_cn: 它无法解决其寻求要修补的问题。

source: More worrying it is part of growing anti-Chinese sentiment in the U.S. that misses the real challenge of China's next phase of development.
zh_cn: 更令人担忧的是，这是美国不断滋长的反华情绪的一部分，这些情绪忽略掉了中国下一阶段发展所带来的真正挑战。

source: There's no doubt that China keeps the renminbi its currency undervalued so it can help its manufacturers sell their toys sweaters and electronics cheaply in foreign markets especially the U.S. and Europe.
zh_cn: 毫无疑问，中国保持其货币人民币低估，以便帮助其制造商在海外市场、尤其是美国和欧洲市场廉价地销售玩具、毛衣以及电子产品。

source: But this is only one of a series of factors that have made China the key manufacturing base of the world. (The others include low wages superb infrastructure hospitality to business compliant unions and a hard-working labor force.)
zh_cn: 但这只是中国成为全球关键的制造基地的一系列因素之一（其他的因素包括低工资、一流的基础设施、贸易友好、顺从的工会以及勤劳的劳动力）。
